/********************************************************
   版权所有 (C), 2001-2100, 四川新健康成生物股份有限公司
  -------------------------------------------------------

				嵌入式开发平台——BSP层 DAC封装

  -------------------------------------------------------
   文 件 名   : BSP_Dac.c
   版 本 号   : V1.0.0.0
   作    者   : ryc
   生成日期   : 2020年05月08日
   功能描述   : 定义一种基于STM32的板级支持包。
				该层依赖于硬件电路。
   依赖于     : STM32F10x_StdPeriph_Lib_V3.5.0
 ********************************************************/
 
#ifndef _BSP_DAC_H_
#define _BSP_DAC_H_

#include "stdint.h"
#include "stdbool.h"
#include "stm32f10x.h"
#include "BSP_Gpio.h"

/* 初始化
  ----------------------------------------------------------------------*/

/* 初始化DAC1
  -----------------------------------------
  返回值：成功true，失败false
*/
extern bool BSP_InitDac1(void);

/* 操作
  ----------------------------------------------------------------------*/

/* DAC1输出电压值
  -----------------------------------------
  入口：电压值，0~3V
  返回值：高电平true，低电平false
*/
extern void BSP_SetDac1(double vol);

#endif
